Revit 2027 API
MacroModuleIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Macro Current { get; }
Public Overridable ReadOnly Property Current As Macro
	Get
public:
virtual property Macro^ Current {
	Macro^ get ();
}
abstract Current : Macro with get
override Current : Macro with get
Property Value
Macro
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace